In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'VarA': ['aa', None, 'cc'],
    'VarB': [20, 30, None],
    'VarC': [1234,3456,6789]
    },
    index = ['Caso1','Caso2','Caso3']
)
df

       VarA  VarB  VarC
Caso1    aa  20.0  1234
Caso2  None  30.0  3456
Caso3    cc   NaN  6789

In [3]:
pd.isnull(df)

        VarA   VarB   VarC
Caso1  False  False  False
Caso2   True  False  False
Caso3  False   True  False

In [4]:
df.dropna(subset=["VarA","VarB"])

      VarA  VarB  VarC
Caso1   aa  20.0  1234

In [5]:
df.fillna("")

      VarA  VarB  VarC
Caso1   aa  20.0  1234
Caso2       30.0  3456
Caso3   cc        6789

In [6]:
df.fillna(23)

      VarA  VarB  VarC
Caso1   aa  20.0  1234
Caso2   23  30.0  3456
Caso3   cc  23.0  6789